tutorials/NACA00122DDyM_backup/constant/wallFilmRegion/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/wallFilmRegion/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    back
    {
        type            empty;
        inGroups        1(empty);
        nFaces          120;
        startFace       120;
    }
    front
    {
        type            empty;
        inGroups        1(empty);
        nFaces          120;
        startFace       240;
    }
    wallFilmFaces_top
    {
        type            patch;
        nFaces          120;
        startFace       360;
    }
    region0_to_wallFilmRegion_wallFilmFaces
    {
        type            mappedWall;
        inGroups        1(wall);
        nFaces          120;
        startFace       480;
        sampleMode      nearestPatchFace;
        sampleRegion    region0;
        samplePatch     region0_to_wallFilmRegion_wallFilmFaces;
        offsetMode      nonuniform;
        offsets         nonuniform List<vector> 
120
(
(0 0 0)
(0 -1.387778780781446e-17 -1.387778780781446e-17)
(-5.551115123125783e-17 -6.938893903907228e-18 0)
(-2.775557561562891e-17 0 0)
(0 0 1.387778780781446e-17)
(-2.775557561562891e-17 6.938893903907228e-18 1.387778780781446e-17)
(2.775557561562891e-17 -6.938893903907228e-18 0)
(0 0 -1.387778780781446e-17)
...
)
;
    }
)

// ************************************************************************* //
