tutorials/NACA00122DDyM_backup/system/wallFilmRegion/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1806                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system/wallFilmRegion";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         Euler;
}

divSchemes
{
    default         none;
    div(phi,Uf)     Gauss upwind;
    div(phid,deltaf) Gauss upwind;
    div(phi,hf)     Gauss upwind;

    div(nHat)       Gauss linear;
    div(grad(nHat)) Gauss linear;
}

gradSchemes
{
    default none;
    grad(pL)        Gauss linear;
    grad(sigmaf)    Gauss linear;
    snGradCorr(deltaf) Gauss linear;
    snGradCorr(pp)  Gauss linear;
    snGradCorr(pu)  Gauss linear;

    grad(radius)    Gauss linear;
    grad(nHat)      Gauss linear;
}

laplacianSchemes
{
    default         none;
    laplacian(sigmaf,deltaf) Gauss linear uncorrected;
    laplacian(deltaCoeff,deltaf) Gauss linear uncorrected;
}

snGradSchemes
{
    snGrad(p)       uncorrected;
    snGrad(deltaf)  uncorrected;
}


// ************************************************************************* //
